;; Souped up org agenda
(package! org-super-agenda)

;; Distraction free writing
(package! olivetti)

(package! org-modern)

;; Required for catpuccin
(package! autothemer)

;; Kubernetes support
(package! kubernetes)
(package! kubernetes-evil)

(package! catppuccin
  :recipe (:host github :repo "catppuccin/emacs"))

(package! exec-path-from-shell)
