;; -*- no-byte-compile: t; -*-
(package! dired-narrow) ;; Directory shit
(package! deadgrep) ;; rg in emacs
(package! easy-kill) ;; easily kill stuff (as in cut/paste)
(package! org-clock-convenience) ;; improve clock workflo
(package! company-posframe) ;; candidate menu changes
(package! org-roam ;; brain
  :recipe (:host github :repo "org-roam/org-roam" :branch "main"))
(package! modus-themes)
(package! dash) ;; list library
(package! org-roam-ui)
(package! tree-sitter)
(package! tree-sitter-langs)
(package! jq-mode)
